"use strict";
// Task 1
/*
let obj = {
	'1a': 1,    //Для данных ключей кавычки обязательны.
	'b2': 2,    //Для данных ключей кавычки не обязательны.
	'с-с': 3,   //Для данных ключей кавычки обязательны.
	'd 4': 4,   //Для данных ключей кавычки обязательны.
	'e5': 5     //Для данных ключей кавычки не обязательны.
};*/


// Task 2

let obj = {
	'1a': 1,
	'b2': 2,
	'c-c': 3,
	'd 4': 4,
	'e5': 5
};
console.log(obj['1a']);
console.log(obj.b2);
console.log(obj['c-c']);
console.log(obj['d 4']);
console.log(obj.e5);